//Класс отвечает за управление отображением информации о пользователе на странице
//Принимает в конструктор объект с селекторами двух элементов: элемента имени пользователя и элемента информации о себе

class UserInfo {
  constructor({ usernameElement, selfInformationItem }) {

  }

  //метод возвращает объект с данными пользователя. Этот метод пригодится когда данные пользователя нужно будет подставить в форму при открытии
  getUserInfo() {

  }

  //метод принимает новые данные пользователя и добавляет их на страницу
  setUserInfo() {

  }
}